RutronikSystemSolutions/RDK4_REV2_RAB5-OSIRE_DEMO/tle926x/TLE926x.c
/*********************************************************************************************************************
 * Copyright (c) 2021, Infineon Technologies AG
 *
 * 
 * Distributed under the Boost Software License, Version 1.0.
 * 
 * 
 * Boost Software License - Version 1.0 - August 17th, 2003
 * 
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 * 
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer,
 * must be included in all copies of the Software, in whole or in part, and
 * all derivative works of the Software, unless such copies or derivative
 * works are solely in the form of machine-executable object code generated by
 * a source language processor.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 * 
 *********************************************************************************************************************/


/********************************************************************************************************
 * @file        TLE926x.c
 *
 * @brief       Implementation of main library functions
 *
 * @version     V1.0.0
 * @date        
 * @author      Fedy Farhat
 * @author      Michael Schaffarczyk
 ********************************************************************************************************/


/* ================================================================================ */
/* ============================   HEADER FILES     ================================ */
/* ================================================================================ */

#include <stdio.h>
#include <tle926x/SBC_TLE926x.h>
#include <tle926x/TLE926x.h>


/* ================================================================================ */
/* ==============================   Variables     ================================= */
/* ================================================================================ */

static uint8_t wd_config;
/* --------------------------------  ISR Handling --------------------------------- */


static    SBC_Func_Callback                 SBC_ISR_Callbacks[60];
static    uint32_t                          SBC_ISR_Vectors[60];
static    uint8_t                           SBC_ISR_ReadOutRegs[60];
static    uint8_t                           SBC_ISR_ReadOutVals[60];
static    uint8_t                           SBC_RegisteredCallbacks = 0;
static    uint8_t                           SBC_RegisteredRedoutRegs = 0;



/* ================================================================================ */
/* ===========================   Library Functions     ============================ */
/* ================================================================================ */


/* --------------------------------  Main Functions ------------------------------- */

// trigger the Watchdog
SBC_ErrorCode sbc_wd_trigger(void) {
    SBC_ErrorCode errCode; 
    if (wd_config == (sbc_read_reg(SBC_WD_CTRL)&0xFF)) {
        return sbc_write_reg(SBC_WD_CTRL, wd_config, NULL);
    } 
    errCode.SBC_Register = SBC_WD_CTRL;
    errCode.flippedBitsMask = ((uint8_t)sbc_read_reg(SBC_WD_CTRL)) ^ wd_config;                        
    errCode.expectedValue = wd_config;
return errCode;

}

// Read the addressed register
uint16_t sbc_read_reg(sbc_register_t sbc_register) {
    /* Read and return data - Bit[15:8] = Status Information Field - Bit [7:0] Register data */
    return  SBC_SPI_TRANSFER16(SBC_READ_MASK & sbc_register, 0x00U);                                 
}

// Read register bit 
uint8_t sbc_read_reg_field(sbc_register_t sbc_register, sbc_bit_mask_t bit_mask) {
    uint8_t data = ((uint8_t)sbc_read_reg(sbc_register)) & 0xFFU;                                                
    return (data & bit_mask) >> SBC_BITPOSITION(bit_mask);                                               
}

 
// Write value to a register
SBC_ErrorCode sbc_write_reg(sbc_register_t sbc_register, uint8_t SBC_Val, uint16_t * returnval) {                      
    SBC_ErrorCode errCode;                                                                                 
    uint16_t returndata = SBC_SPI_TRANSFER16(SBC_WRITE_BIT | sbc_register, SBC_Val);                            
    if(returnval != NULL) {                                                                                
        *returnval = returndata;                                                                        
    }

    errCode.SBC_Register = sbc_register;
    errCode.flippedBitsMask = ((uint8_t)sbc_read_reg(sbc_register)) ^ SBC_Val;                             
    errCode.expectedValue = SBC_Val;


    return errCode; 
}

/*Write bit value in register*/
SBC_ErrorCode sbc_write_reg_field(sbc_register_t sbc_register, sbc_bit_mask_t bit_mask, uint8_t val, uint16_t * returnval) 
{ 
    SBC_ErrorCode errCode;

    /* Read data out of register to be manipulated */
    uint16_t returndata = sbc_read_reg(sbc_register);
    if(returnval != NULL) {
        *returnval = returndata;
    }
     /* pick the first 8 bit of read SBC_Reg, meant register data [7:0]*/
    uint8_t data = (uint8_t)returndata;

    /* Set the used bit field to all 0 */
    data &= ~(bit_mask); 
                            
    /* Configure new data to bit field */
    data |= (val << SBC_BITPOSITION(bit_mask)); 

