RutronikSystemSolutions/RDK4_REV2_RAB5-OSIRE_DEMO/tle926x/TLE926x.c
    (void)SBC_SPI_TRANSFER16(SBC_WRITE_BIT | sbc_register, data); 
                                                            
    errCode.SBC_Register = sbc_register;  
    errCode.expectedValue = (val <<  SBC_BITPOSITION(bit_mask)); 
    uint8_t actualValue = ((uint8_t)sbc_read_reg(sbc_register)) & bit_mask; 
    errCode.flippedBitsMask = errCode.expectedValue ^ actualValue; 
                                                                




    return errCode; 
}

/* initialize SBC */
SBC_ErrorCode sbc_init(void) {                                           
    SBC_ErrorCode errCode;
    
    uint8_t famprod;
    uint8_t sbc_family;
    uint8_t sbc_product;
    uint8_t i;
    uint8_t cond;


    uint8_t WD_CTRL = CW_WD_CTRL;
    /*
    uint8_t SWK_ID3_CTRL, SWK_ID2_CTRL, SWK_ID1_CTRL, SWK_ID0_CTRL;
    uint8_t SWK_MASK_ID3_CTRL, SWK_MASK_ID2_CTRL, SWK_MASK_ID1_CTRL, SWK_MASK_ID0_CTRL;
    */
    uint8_t SWK_CAN_FD_CTRL = CW_SWK_CAN_FD_CTRL;

	uint8_t checksum = WD_CTRL; 

                        
                        
    checksum = checksum ^ checksum >> 4; 
    checksum = checksum ^ checksum >> 2;      
    checksum = checksum ^ checksum >> 1;
 

    if((checksum & 1) > 0) { 
        /* Set parity bit */
        WD_CTRL = WD_CTRL | 0x80U; // 
    }
	wd_config = WD_CTRL;

    /* Check if ID is configured to be extended */
    if((CW_SWK_ID0_CTRL &  IDE_MASK ) == SBC_IDE_EXTENDED) {
        /* extended ID (29 bits) */
    	/*
        uint32_t SWK_ID_CTRL = UI_SWK_IDx_CTRL << 3; //  new variable with extended ID to 29 bit
        uint32_t SWK_MASK_ID_CTRL = UI_SWK_MASK_IDx_CTRL << 3; // new variable with extended mask to 29 bit
        */

        /*
        SWK_ID3_CTRL = (uint8_t)(SWK_ID_CTRL >> 24); // take last 8 bits [31:23] from  extended ID
        SWK_ID2_CTRL = (uint8_t)(SWK_ID_CTRL >> 16); // take 8 bits [22:14] from  extended ID
        SWK_ID1_CTRL = (uint8_t)(SWK_ID_CTRL >> 8); // take 8 bits [13:5] from  extended ID
        SWK_ID0_CTRL = (((uint8_t)(SWK_ID_CTRL >> 1)) & MASK_ID4_0_MASK ) | SBC_IDE_EXTENDED;
        SWK_MASK_ID3_CTRL = (uint8_t)(SWK_MASK_ID_CTRL >> 24);
        SWK_MASK_ID2_CTRL = (uint8_t)(SWK_MASK_ID_CTRL >> 16);
        SWK_MASK_ID1_CTRL = (uint8_t)(SWK_MASK_ID_CTRL >> 8);
        SWK_MASK_ID0_CTRL = (((uint8_t)(SWK_MASK_ID_CTRL >> 1)) & MASK_ID4_0_MASK );
        */
    } else {
        /* Standard length ID (11 bits) */ 
    	/*
        uint16_t SWK_ID_CTRL = UI_SWK_IDx_CTRL;
        uint32_t SWK_MASK_ID_CTRL = UI_SWK_MASK_IDx_CTRL;
        */

        /*
        SWK_ID3_CTRL = (uint8_t)(SWK_ID_CTRL >> 3); 
        SWK_ID2_CTRL = (uint8_t)(SWK_ID_CTRL << 5); 
        SWK_ID1_CTRL = 0x00U;  
        SWK_ID0_CTRL = 0x00U; 
        SWK_MASK_ID3_CTRL = (uint8_t)(SWK_MASK_ID_CTRL >> 3);
        SWK_MASK_ID2_CTRL = (uint8_t)(SWK_MASK_ID_CTRL << 5);
        SWK_MASK_ID1_CTRL = 0x00U;
        SWK_MASK_ID0_CTRL = 0x00U;
        */
    }
    

    /* DIS_ERR_CNT is set only when FD Tolerance is set.
       Set DIS_ERR_CNT value to 1 if the value of CAN_FD_EN is 1 */
   
    if((CW_SWK_CAN_FD_CTRL & CAN_FD_EN_MASK) == SBC_CAN_FD_EN_ENABLED) {
        SWK_CAN_FD_CTRL |= SBC_DIS_ERR_CNT_DISABLED << SBC_BITPOSITION(DIS_ERR_CNT_MASK);
    }

    /* Describes initialization sequence.
       init Sequence containing {reg_address, reg_value}*/
    uint8_t initSequence[43][2] = {
        {SBC_WD_CTRL, WD_CTRL},
        {SBC_M_S_CTRL, CW_M_S_CTRL},
        {SBC_HW_CTRL, CW_HW_CTRL},
        {SBC_BUS_CTRL_1, CW_BUS_CTRL_1},
        {SBC_BUS_CTRL_2, CW_BUS_CTRL_2},
        {SBC_WK_CTRL_1, CW_WK_CTRL_1},
        {SBC_WK_CTRL_2, CW_WK_CTRL_2},
        {SBC_WK_PUPD_CTRL, CW_WK_PUPD_CTRL},
        {SBC_WK_FLT_CTRL, CW_WK_FLT_CTRL},
        {SBC_TIMER1_CTRL, CW_TIMER1_CTRL},
        {SBC_TIMER2_CTRL, CW_TIMER2_CTRL},
        {SBC_SW_SD_CTRL, CW_SW_SD_CTRL},
        {SBC_HS_CTRL_1, CW_HS_CTRL1},
        {SBC_HS_CTRL_2, CW_HS_CTRL2},
        {SBC_PWM1_CTRL, CW_PWM1_CTRL},
        {SBC_PWM2_CTRL, CW_PWM2_CTRL},
        {SBC_PWM_FREQ_CTRL, CW_PWM_FREQ_CTRL}, /* The desired duty cycle should be set first before GPIO is enabled as PWM HS or PWM LS. */
        {SBC_GPIO_CTRL, CW_GPIO_CTRL},

        /* -------------------------- SELECTIVE WAKE REGISTERS --------------------------- */

        /* Configuring CDR */ // CDR = Clock and Data Recovery
        {SBC_SWK_CDR_CTRL2, CW_SWK_CDR_CTRL2},
        {SBC_SWK_BTL1_CTRL, CW_SWK_BTL1_CTRL},
        {SBC_SWK_BTL2_CTRL, CW_SWK_BTL2_CTRL},
        {SBC_SWK_CDR_LIMIT_HIGH, CW_SWK_CDR_LIMIT_HIGH_CTRL},
        {SBC_SWK_CDR_LIMIT_LOW, CW_SWK_CDR_LIMIT_LOW_CTRL},
        {SBC_SWK_CDR_CTRL1, ((SBC_SEL_FILT_TC16 << SBC_BITPOSITION(SELFILT_MASK)) | (SBC_CDR_EN_ENABLED << SBC_BITPOSITION(CDR_EN_MASK)))},
                          
                        

        /* Set ID */
        {SBC_SWK_ID3_CTRL, CW_SWK_ID3_CTRL},
        {SBC_SWK_ID2_CTRL, CW_SWK_ID2_CTRL},
        {SBC_SWK_ID1_CTRL, CW_SWK_ID1_CTRL},
        {SBC_SWK_ID0_CTRL, CW_SWK_ID0_CTRL},

        /* Set Mask */
        {SBC_SWK_MASK_ID3_CTRL, CW_SWK_MASK_ID3_CTRL},
        {SBC_SWK_MASK_ID2_CTRL, CW_SWK_MASK_ID2_CTRL},
        {SBC_SWK_MASK_ID1_CTRL, CW_SWK_MASK_ID1_CTRL},
        {SBC_SWK_MASK_ID0_CTRL, CW_SWK_MASK_ID0_CTRL},

        /* Set Data */ 

        {SBC_SWK_DATA7_CTRL, (uint8_t)(CW_SWK_DATA_H_CTRL >> 24)},
        {SBC_SWK_DATA6_CTRL, (uint8_t)(CW_SWK_DATA_H_CTRL >> 16)},
        {SBC_SWK_DATA5_CTRL, (uint8_t)(CW_SWK_DATA_H_CTRL >> 8)},
        {SBC_SWK_DATA4_CTRL, (uint8_t)(CW_SWK_DATA_H_CTRL >> 0)},
        {SBC_SWK_DATA3_CTRL, (uint8_t)(CW_SWK_DATA_L_CTRL >> 24)},
        {SBC_SWK_DATA2_CTRL, (uint8_t)(CW_SWK_DATA_L_CTRL >> 16)},
        {SBC_SWK_DATA1_CTRL, (uint8_t)(CW_SWK_DATA_L_CTRL >> 8)},
        {SBC_SWK_DATA0_CTRL, (uint8_t)(CW_SWK_DATA_L_CTRL >> 0)},

            

         /* Set DLC */
       {SBC_SWK_DLC_CTRL, CW_SWK_DLC_CTRL}, 

       {SBC_SWK_CAN_FD_CTRL, CW_SWK_CAN_FD_CTRL},

        /* End Configuration */ 
        {0x00U, 0x00U}
    };

    /* Call SPI Init */ 
    if(sbc_spi_init() != 0) { 
        errCode.SBC_Register = 0x00;
        errCode.flippedBitsMask = 0x01; 
        errCode.expectedValue = 0x00;
        return errCode;
    };


/* Check if SBC is Mid-Range SBC */
    famprod = sbc_read_reg(SBC_FAM_PROD_STAT);
    sbc_family = (famprod & FAM_MASK) >> SBC_BITPOSITION(FAM_MASK);
    sbc_product = famprod & PROD_MASK;
    cond = ((sbc_family == MID_RANGE_SBC_FAMILY || sbc_family == MID_RANGE_PLUS_SBC_FAMILY) & (sbc_product == 11));
    if (!cond) {
        errCode.flippedBitsMask=0x02;
        return errCode;
    }
  
