RutronikSystemSolutions/RDK4_REV2_RAB5-OSIRE_DEMO/tle926x/TLE926x.c
    /*soft reset*/
    sbc_write_reg_field (SBC_M_S_CTRL, MODE_MASK, SBC_RESET, 0x00); // M_S_CTRL(0x81)
    Cy_SysLib_Delay(100);

    /* reset index */
    i =0;
  
    /* Write all initialization items to Lite SBC 
     write the above defined reg_values inside the real registers on Lite SBC*/

    while(initSequence[i][0] != 0x00U || initSequence[i][1] != 0x00U) {
     errCode = sbc_write_reg((sbc_register_t) initSequence[i][0],(sbc_register_t) initSequence[i][1], NULL);
     
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        i++;
    }

    errCode.SBC_Register = 0x00;
    errCode.flippedBitsMask = 0x00;
    errCode.expectedValue = 0x00;
    return errCode;
}

/* --------------------------------  ISR Functions -------------------------------- */

/* Callback function*/
void sbc_register_callback(uint32_t vector_isr, void (*Callback_Handler)(uint8_t callbackHandler)) {

    /* Save callback */
    SBC_ISR_Callbacks[SBC_RegisteredCallbacks] = Callback_Handler;

    /* Save callback vector */
    
    SBC_ISR_Vectors[SBC_RegisteredCallbacks] =  vector_isr;

    /* Check if the register will be readout already to avoid double-readout later */
    uint8_t RegFound = 0;
    for (uint8_t i = 0; i < SBC_RegisteredRedoutRegs; i++) {
        if (SBC_ISR_ReadOutRegs[i] == ( vector_isr >> 24)) {  
                                                             
                                                             
            RegFound = 1;
        }
    }

    /* If readout status-reg was not found, register in the readout list */
    if (RegFound == 0) {
        SBC_ISR_ReadOutRegs[SBC_RegisteredRedoutRegs] = (uint8_t)( vector_isr>> 24);
        SBC_RegisteredRedoutRegs++;
    }

    SBC_RegisteredCallbacks++;
}


SBC_ErrorCode SBC_ISR(void) {
    SBC_ErrorCode errCode;

    /* Readout all registered status-registers */
    for (uint8_t i = 0; i < SBC_RegisteredRedoutRegs; i++) {
        SBC_ISR_ReadOutVals[i] = (uint8_t) sbc_read_reg( (sbc_register_t) SBC_ISR_ReadOutRegs[i]);
    }

    /* Handle all interrupts */
    
    for (uint8_t i = 0; i < SBC_RegisteredCallbacks; i++) {
        /* Decode ISR Vector */
        uint8_t Compare = (uint8_t)SBC_ISR_Vectors[i];
        uint8_t FieldPos = (uint8_t)(SBC_ISR_Vectors[i] >> 8);
        uint8_t FieldMsk = (uint8_t)(SBC_ISR_Vectors[i] >> 16);
        uint8_t RegAddr = (uint8_t)(SBC_ISR_Vectors[i] >> 24);

        /* Readback of associated status-bit */
        uint8_t ReadBack = 0;
        for (uint8_t j = 0; j < SBC_RegisteredRedoutRegs; j++) {
            if (SBC_ISR_ReadOutRegs[j] == RegAddr) {
                ReadBack = SBC_ISR_ReadOutVals[j];
                break;
          }
        }

        /* If compare-values matched -> proceed callback and clear field */
        if (((ReadBack & FieldMsk) >> FieldPos) == Compare) {
            SBC_ISR_Callbacks[i](ReadBack);
        }
    }

    /* Clear all ISR related registers */
    for (uint8_t i = 0; i < SBC_RegisteredRedoutRegs; i++) {
        errCode = sbc_write_reg( (sbc_register_t) SBC_ISR_ReadOutRegs[i], 0x00U, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
    }

    errCode.SBC_Register = 0x00U;
    errCode.flippedBitsMask = 0x00U;
    errCode.expectedValue = 0x00U;
    return errCode;
}



/* --------------------------------  API Calls  ----------------------------------- */
/* enter Normal Mode*/
SBC_ErrorCode sbc_mode_normal(void) {
    return sbc_write_reg_field(SBC_M_S_CTRL, MODE_MASK, SBC_NORMAL_MODE, NULL);
}

/* enter Stop Mode*/
SBC_ErrorCode sbc_mode_stop (void) {
    return sbc_write_reg_field(SBC_M_S_CTRL, MODE_MASK, SBC_STOP_MODE, NULL);
}

/* enter Sleep Mode*/
SBC_ErrorCode sbc_mode_sleep(void) {
    uint8_t registerReadOut;

    SBC_ErrorCode errCode;



/* Check SBC in Normal Mode */
    uint8_t readData = sbc_read_reg(SBC_M_S_CTRL);
    readData >>= SBC_BITPOSITION(MODE_MASK);

    if (readData != SBC_NORMAL_MODE) {
        errCode = sbc_mode_normal();
        return errCode;
    }

    /* If CAN PN is configured */
    if(MATH_EN_PN != 0) {

        /* Reading value of SWK_STAT. */
        registerReadOut = (uint8_t)sbc_read_reg(SBC_SWK_STAT);

        /* The selective wake routine should be aborted if sync is not set. 
           Note: for SYNC to be set the transceiver must have been in Normal Mode and */
        if((registerReadOut & SYNC_MASK ) >> SBC_BITPOSITION(SYNC_MASK) != SYNC_VALID_FRAME_RECEIVED) {
            errCode.SBC_Register = SBC_SWK_STAT;
            errCode.flippedBitsMask = SYNC_MASK;
            errCode.expectedValue =  SYNC_VALID_FRAME_RECEIVED << SBC_BITPOSITION(SYNC_MASK);
            return errCode;
        }


        /* Set SWK Configuration valid */
        // set CFG_VAL = 1
         
        errCode = sbc_write_reg_field(SBC_SWK_CTRL, CFG_VAL_MASK, SBC_CFG_VAL_VALID, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
    
    
    /* Clear SYSERR bit */
    
        errCode = sbc_write_reg_field(SBC_BUS_STAT_1, SYSERR_MASK, 0x00, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        } 

        /* Set CAN Mode to off and once again to desired configuration */
        // CAN OFF
        errCode = sbc_write_reg_field(SBC_BUS_CTRL_1, CAN_MASK, CAN_OFF, NULL); 
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
    // CAN ON (with SWK)
        errCode = sbc_write_reg_field(SBC_BUS_CTRL_1, CAN_MASK, CAN_WAKECAPABLE_SWK, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }

     /* Check SWK_STAT for SYNC == 1 && SWK_SET == 1 && WUF == 0 && WUP == 0. Ignore CANSIL */
    registerReadOut = (uint8_t)sbc_read_reg(SBC_SWK_STAT);
        if(        ((SYNC_MASK & registerReadOut) == SYNC_MASK)
            && ((SWK_SET_MASK & registerReadOut) == SWK_SET_MASK)
            && ((WUP_MASK & registerReadOut) != WUP_MASK)
            && ((WUF_MASK & registerReadOut) != WUF_MASK)) {
        /* Empty */ 

        } else {
            errCode.SBC_Register = SBC_SWK_STAT;
            errCode.expectedValue = 0b01000100U;
            errCode.flippedBitsMask = errCode.expectedValue ^ registerReadOut;  
            return errCode;
        }
    
    
    
