RutronikSystemSolutions/RDK4_REV2_RAB5-OSIRE_DEMO/tle926x/TLE926x.c
    }

  

    /* Clear Wake Status Registers, so that SBC can sleep. */
    errCode = sbc_write_reg(SBC_WK_STAT_1, 0x00, NULL);
    if(errCode.flippedBitsMask > 0) {
        return errCode;
    }
    errCode = sbc_write_reg(SBC_WK_STAT_2, 0x00, NULL);
    if(errCode.flippedBitsMask > 0) {
        return errCode;
    }
  
    /* Select sleep mode */
     sbc_write_reg_field(SBC_M_S_CTRL, MODE_MASK, SBC_SLEEP_MODE, NULL);
     
    errCode.SBC_Register = 0x00U;
    errCode.flippedBitsMask = 0x00U;
    errCode.expectedValue = 0x00U;
    return errCode;
}

/* configure HSx  */
SBC_ErrorCode sbc_hsx_config(sbc_hsx_t hsX, sbc_hs_config_t hsConfig) {
	SBC_ErrorCode errCode = {0};

    switch (hsX) {
    case HS1:
        errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS1_MASK, hsConfig, NULL);
        break;
    case HS2:
        errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS2_MASK, hsConfig, NULL);
        break;
    case HS3:
        errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS3_MASK, hsConfig, NULL);
        break;
    case HS4:
        errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS4_MASK, hsConfig, NULL);
        break;

    default:
        return errCode;
    }
    return errCode;
}



/* CAN MODE*/ 
SBC_ErrorCode sbc_can_mode(sbc_can_t CANmode )  
{
    SBC_ErrorCode errCode; 
    errCode =  sbc_write_reg_field(SBC_BUS_CTRL_1, CAN_MASK, CANmode, NULL);
   
return errCode; 
}


/* LIN MODE */
SBC_ErrorCode sbc_lin_mode(sbc_lin_module_t linModule, sbc_lin_mode_t linMode) {
    SBC_ErrorCode errCode = {0};
    uint8_t mr_sbc_variant = sbc_read_reg(SBC_FAM_PROD_STAT) & PROD_MASK;
       /* check if it is a variant with minimum 1 LIN interface*/
    if (mr_sbc_variant & 0b1000) { 
        if (linModule == LIN1) {
            errCode = sbc_write_reg_field(SBC_BUS_CTRL_1, LIN1_MASK, linMode, NULL);
        } else {
             /* cheack if it is a variant with 2 LIN interfaces*/
            if (mr_sbc_variant & 0b1100) {
                errCode = sbc_write_reg_field(SBC_BUS_CTRL_2, LIN2_MASK, linMode, NULL);
            } else {
                 
                return errCode; // default value 0 
            }
        }
    } else {

        return errCode; // default value 0 
    }
    return errCode;
}
/* WRITE IN System status register*/
SBC_ErrorCode sbc_sys_stat_write(uint8_t status) {
  return sbc_write_reg(SBC_SYS_STAT_CTRL, status, NULL);
}

/* Read register system status*/
uint8_t sbc_sys_stat_read(void) {
    return sbc_read_reg(SBC_SYS_STAT_CTRL);
}
// disabling WD  and entering stop mode
SBC_ErrorCode sbc_mode_stop_without_watchdog(void)
{
	SBC_ErrorCode errCode = sbc_write_reg_field(SBC_WK_CTRL_1, WD_STM_EN_1_MASK, WATCHDOG_DEACTIVED_IN_STOP_MODE, NULL);

	if(errCode.flippedBitsMask > 0)
	{
		return errCode;
	}

    errCode = sbc_write_reg_field(SBC_WD_CTRL, WD_STM_EN_0_MASK, WATCHDOG_DEACTIVED_IN_STOP_MODE, NULL);
    if(errCode.flippedBitsMask > 0)
    {
    	return errCode;
    }

    return sbc_mode_stop();
}


/* configure cyclic sense function*/
SBC_ErrorCode sbc_cyclicsense(sbc_timer_t timer, sbc_timer_per_t timerPeriod, sbc_timer_on_t timerOnTime, sbc_hsx_t hsX, sbc_wk_t wk, sbc_wk_pupd_t pupdConfig) {
    SBC_ErrorCode errCode = {0};

    if (timer == TIMER1) {
        errCode = sbc_write_reg_field(SBC_TIMER1_CTRL, TIMER1_ON_MASK, TIMER_ONTIME_OFF_LOW, NULL);
      if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        switch (hsX)
        {
        case HS1:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS1_MASK, CONTROLLED_BY_TIMER1, NULL);
            break;
        case HS2:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS2_MASK, CONTROLLED_BY_TIMER1, NULL);
            break;
        case HS3:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS3_MASK, CONTROLLED_BY_TIMER1, NULL);
            break;
        case HS4:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS4_MASK, CONTROLLED_BY_TIMER1, NULL);
            break;
        default:
            return errCode;
        }

       if(errCode.flippedBitsMask > 0){
            return errCode;
        }
        switch (wk) {
        case WK1:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK1_FLT_MASK, FILTER_ONTIME_END_TIMER1, NULL);
            if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK1_PUPD_MASK, pupdConfig, NULL);
            break;
        case WK2:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK2_FLT_MASK, FILTER_ONTIME_END_TIMER1, NULL);
           if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK2_PUPD_MASK, pupdConfig, NULL);
            break;
        case WK3:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK3_FLT_MASK, FILTER_ONTIME_END_TIMER1, NULL);
           if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK3_PUPD_MASK, pupdConfig, NULL);
            break;
        default:
            break;
        }
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }

        errCode = sbc_write_reg_field(SBC_TIMER1_CTRL, TIMER1_PER_MASK, timerPeriod, NULL);

      if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_TIMER1_CTRL, TIMER1_ON_MASK, timerOnTime, NULL);
    }
    else if (timer == TIMER2)
    {
        errCode = sbc_write_reg_field(SBC_TIMER2_CTRL, TIMER2_ON_MASK, TIMER_ONTIME_OFF_LOW, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        switch (hsX) {
        case HS1:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS1_MASK, CONTROLLED_BY_TIMER2, NULL);
            break;
        case HS2:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_1, HS2_MASK, CONTROLLED_BY_TIMER2, NULL);
            break;
        case HS3:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS3_MASK, CONTROLLED_BY_TIMER2, NULL);
            break;
        case HS4:
            errCode = sbc_write_reg_field(SBC_HS_CTRL_2, HS4_MASK, CONTROLLED_BY_TIMER2, NULL);
            break;
        default:
            return errCode;
        }

      if(errCode.flippedBitsMask > 0) {
            return errCode;
        }

        switch (wk)
        {
        case WK1:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK1_FLT_MASK, FILTER_ONTIME_END_TIMER2, NULL);
           if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK1_PUPD_MASK, pupdConfig, NULL);
            break;
        case WK2:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK2_FLT_MASK, FILTER_ONTIME_END_TIMER2, NULL);
          if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK2_PUPD_MASK, pupdConfig, NULL);
            break;
        case WK3:
            errCode = sbc_write_reg_field(SBC_WK_FLT_CTRL, WK3_FLT_MASK, FILTER_ONTIME_END_TIMER2, NULL);
           if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
            errCode = sbc_write_reg_field(SBC_WK_PUPD_CTRL, WK3_PUPD_MASK, pupdConfig, NULL);
            break;
        default:
            break;
        }
        errCode = sbc_write_reg_field(SBC_TIMER2_CTRL, TIMER2_PER_MASK, timerPeriod, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_TIMER2_CTRL, TIMER2_ON_MASK, timerOnTime, NULL);
    } else {
        return errCode;
    }
    return errCode;
}

/* configure cyclic wake function*/
SBC_ErrorCode sbc_cyclicwake(sbc_timer_t timer, sbc_timer_per_t timer_period, sbc_timer_on_t timer_on_time) {
    SBC_ErrorCode errCode = {0};

    if (timer == TIMER1) {
        errCode = sbc_write_reg_field(SBC_WK_CTRL_1, TIMER1_WK_EN_MASK, TIMER_WAKE_DISABLED, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_TIMER1_CTRL, TIMER1_PER_MASK, timer_period, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_TIMER1_CTRL, TIMER1_ON_MASK, timer_on_time, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_WK_CTRL_1, TIMER1_WK_EN_MASK, TIMER_WAKE_ENABLED, NULL);
    } 
    else if (timer == TIMER2) {
        errCode = sbc_write_reg_field(SBC_WK_CTRL_1, TIMER2_WK_EN_MASK, TIMER_WAKE_DISABLED, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        
        errCode = sbc_write_reg_field(SBC_TIMER2_CTRL, TIMER2_PER_MASK, timer_period, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_TIMER2_CTRL, TIMER2_ON_MASK, timer_on_time, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_WK_CTRL_1, TIMER2_WK_EN_MASK, TIMER_WAKE_ENABLED, NULL);
}   else {
        return errCode;
    }
    return errCode;
}


/* configure watchdog*/
SBC_ErrorCode sbc_configure_watchdog(sbc_wd_win_t wdWindow, sbc_wd_en_wk_bus_t wdEnableAfterBusWake, sbc_wd_timer_t wdTimer) {
    SBC_ErrorCode errCode;
     /* Calculate checksum */ 
    uint8_t wd_ctrl = (wdWindow << SBC_BITPOSITION(WD_WIN_MASK))
                    | (wdEnableAfterBusWake << SBC_BITPOSITION(WD_EN_WK_BUS_MASK))
                    | (wdTimer << SBC_BITPOSITION(WD_TIMER_MASK));
    uint8_t checksum = wd_ctrl; 

                        
                        
    checksum = checksum ^ checksum >> 4; 
    checksum = checksum ^ checksum >> 2;      
    checksum = checksum ^ checksum >> 1;
 

