RutronikSystemSolutions/RDK4_REV2_RAB5-OSIRE_DEMO/tle926x/TLE926x.c
    if((checksum & 1) > 0) { 
        /* Set parity bit */
        wd_ctrl = wd_ctrl | 0x80U; // 
    }
    errCode = sbc_write_reg(SBC_WD_CTRL, wd_ctrl, NULL);
    if (errCode.flippedBitsMask == 0) {

        /* Save new Watchdog configuration to global variable */
        wd_config = wd_ctrl;
    }
    return errCode;
}

/* configure PWM*/
SBC_ErrorCode sbc_configure_pwm(sbc_pwm_t pwm, sbc_pwm_freq_t frequency, uint8_t dutyCycle) {
    SBC_ErrorCode errCode = {0};
    switch (pwm) {
    case PWM1:
        errCode = sbc_write_reg(SBC_PWM1_CTRL, dutyCycle, NULL);
       if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_PWM_FREQ_CTRL, PWM1_FREQ_MASK, frequency, NULL);
        break;
    case PWM2:
        errCode = sbc_write_reg(SBC_PWM2_CTRL, dutyCycle, NULL);
        if(errCode.flippedBitsMask > 0) {
            return errCode;
        }
        errCode = sbc_write_reg_field(SBC_PWM_FREQ_CTRL, PWM2_FREQ_MASK, frequency, NULL);
        break;

    default:
        return errCode;
    }
    return errCode;
}

/* configure PWM percentage*/
SBC_ErrorCode sbc_configure_pwm_percentage(sbc_pwm_t pwm, sbc_pwm_freq_t frequency, double duty_cycle) {
    return sbc_configure_pwm(pwm, frequency, (uint8_t)(duty_cycle*0xFFU));
}

/* Configure GPIO*/
SBC_ErrorCode sbc_configure_gpio(sbc_gpiox_t gpio, sbc_gpio_t gpio_config) {
    SBC_ErrorCode errCode = {0};
    switch (gpio) {
    case GPIO1:
        errCode = sbc_write_reg_field(SBC_GPIO_CTRL, GPIO1_MASK, gpio_config, NULL);
        break;
    case GPIO2:
        errCode = sbc_write_reg_field(SBC_GPIO_CTRL, GPIO2_MASK, gpio_config, NULL);
        break;

    default:
        return errCode;
    }

    return errCode;
}


/* Configure Failure Output*/
SBC_ErrorCode sbc_fo_x(uint8_t on) {
    if (on) {
        return sbc_write_reg_field(SBC_HW_CTRL, FO_ON_MASK, FO_ON_ACTIVE, NULL);   
    } else {
        return sbc_write_reg_field(SBC_HW_CTRL, FO_ON_MASK, FO_ON_NOT_ACTIVE, NULL);   
    }
}
/* configure VCC2*/
SBC_ErrorCode sbc_switch_vcc2(sbc_vcc2_on_t vcc2_value) {
 SBC_ErrorCode errCode;

  errCode =  sbc_write_reg_field(SBC_M_S_CTRL, VCC2_ON_MASK, vcc2_value, NULL);
   
    return errCode;
}
/* configure VCC3*/
SBC_ErrorCode sbc_switch_vcc3(sbc_vcc3_on_t vcc3_value) {
     SBC_ErrorCode errCode;
 errCode =  sbc_write_reg_field(SBC_M_S_CTRL, VCC3_ON_MASK , vcc3_value, NULL);
    
         return errCode;
}
